# ==================== THIRD-PARTY TAPS ====================
tap "pulumi/tap"          # Infrastructure as Code tool
tap "radulucut/cleed"     # Custom tap for cleed tool

# ==================== SHELL & TERMINAL ====================
brew "autojump"           # Fast directory navigation (j command)
brew "bat"                # Better cat with syntax highlighting
brew "tmux"               # Terminal multiplexer for session management
brew "tree"               # Display directory structure

# ==================== VERSION MANAGERS ====================
brew "goenv"              # Go version manager
brew "nvm"                # Node.js version manager
brew "pyenv"              # Python version manager
brew "rustup"             # Rust toolchain installer

# ==================== PROGRAMMING LANGUAGES ====================
brew "ruby"               # Ruby 3.4+ (required for CocoaPods/Flutter iOS)

# ==================== GIT TOOLS ====================
brew "git"                # Version control
brew "gh"                 # GitHub CLI for PRs, issues, etc.
brew "lazygit"            # Terminal UI for git commands

# ==================== DEVELOPMENT TOOLS ====================
brew "neovim"             # Modern Vim-based text editor
brew "go-task"            # Task runner (Taskfile.yml)
brew "mage"               # Make-like build tool for Go
brew "luarocks"           # Lua package manager (for Neovim plugins)
brew "deno"               # JavaScript/TypeScript runtime
brew "buf"                # Protocol Buffers tooling (linting, breaking change detection)

# ==================== SEARCH & FILES ====================
brew "fd"                 # Fast alternative to find
brew "ripgrep"            # Fast grep alternative (rg)

# ==================== CLOUD & INFRASTRUCTURE ====================
brew "awscli"             # AWS command line interface
brew "terraform"          # Infrastructure as Code
brew "pulumi/tap/pulumi"  # Modern Infrastructure as Code

# ==================== UTILITIES ====================
brew "coreutils"          # GNU core utilities for macOS
brew "curl"               # Transfer data with URLs
brew "httpie"             # User-friendly HTTP client
brew "pngpaste"           # Paste PNG images from clipboard (for markdown)
brew "poppler"            # PDF rendering library
brew "radulucut/cleed/cleed"  # Custom utility

# ==================== PACKAGE MANAGERS ====================
brew "pnpm"               # Fast, disk-efficient npm alternative

# ==================== CONTAINERIZATION ====================
brew "docker"             # Docker CLI and tooling
# Note: Was previously set to 'link: false' when using Docker Desktop

# ==================== APPLICATIONS (CASKS) ====================
cask "docker-desktop"     # Docker Desktop for Mac
cask "flutter"            # Flutter SDK for mobile/web development
cask "ghostty"            # Fast, native terminal emulator
