tap "pulumi/tap"
tap "radulucut/cleed"
brew "autojump"
brew "awscli"
brew "bat"
brew "coreutils"
brew "curl"
brew "deno"
brew "docker", link: false
brew "fd"
brew "gh"
brew "git"
brew "go-task"
brew "goenv"
brew "httpie"
brew "lazygit"
brew "luarocks"
brew "mage"
brew "neovim"
brew "nvm"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "terraform"
brew "tmux"
brew "tree"
brew "pulumi/tap/pulumi"
brew "radulucut/cleed/cleed"
cask "docker-desktop"
cask "flutter"
cask "ghostty"
